app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (name LIKE '%it%' or author LIKE '%it%')
---
  def index
    @books = Book.search(params[:term])

INSERT INTO "books" ("name", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "It"], ["author", "Stephen King"], ["created_at", "2018-01-09 05:33:38.235568"], ["updated_at", "2018-01-09 05:33:38.235568"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save